_Rarzrabotki/Rarus/USO2/DataProcessors/УСОERP_ФормированиеВыработкиСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>УСОERP_ФормированиеВыработкиСотрудников</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСбораДанных</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Работа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ресурс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_Ресурсы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТабельИсполнителяРабот</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Признак</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Работа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ресурс</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_Ресурсы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДолжностьТипМашинМеханизмов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
								<v8:Type>cfg:CatalogRef.ТипыТранспортныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Исполнитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбщееКоличествоЧасов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВыработкаСотрудников</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Работа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Исполнитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЧасов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтоимостьЧаса</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбщаяСтоимостьРаботы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыработкаСотрудников</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ВыработкаСотрудников</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/AccumulationRegisters/УСОERP_ТабельИсполнителейРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>УСОERP_ТабельИсполнителейРабот</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Работа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ресурс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_Ресурсы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипРесурса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
						<v8:Type>cfg:CatalogRef.ТипыТранспортныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/УСОERP_СтоимостьРесурсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>УСОERP_СтоимостьРесурсов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ресурс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_Ресурсы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектСтоимости</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
						<v8:Type>cfg:CatalogRef.ТипыТранспортныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/ВидыБригадныхНарядов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВидыБригадныхНарядов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Производство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ремонт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Персональный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бригадный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БригадныйБезЗаказа21</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БригадныйПоЗаказу21</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/DataProcessors/УСОERP_ФормированиеВыработкиСотрудников/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиКоммндФормы

&НаКлиенте
Процедура Далее(Команда)

	Если Элементы.ГруппаОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаШаг1 Тогда
		
		Если ПроверитьЗаполнение() Тогда
			ЗаполнитьТабельИсполнителяРабот();
		Иначе 
			Возврат;
		КонецЕсли;
		
		Элементы.ГруппаОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаШаг2;
		
	ИначеЕсли Элементы.ГруппаОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаШаг2 Тогда 
		
		ЗаполнитьВыработкуСотрудников();
		
		Элементы.ГруппаОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаШаг3;
		
	КонецЕсли;
	
	УстановитьВидимостьКнопокКоманднойПанели(Элементы.ГруппаОсновнаяПанель.ТекущаяСтраница);
	
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)

	Если Элементы.ГруппаОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаШаг3 Тогда
		
		Если Объект.ВыработкаСотрудников.Количество() Тогда
			
			ОписаниеОповещения = Новый ОписаниеОповещения("НазадШаг3Продолжение",ЭтотОбъект);
			
			СписокКнопок = Новый СписокЗначений;
			СписокКнопок.Добавить(КодВозвратаДиалога.Да,"Удалить сформированные документы");
			СписокКнопок.Добавить(КодВозвратаДиалога.Отмена,"Отмена");
						
			ПоказатьВопрос(ОписаниеОповещения,"При переходе назад сформированные документы будут удалены",СписокКнопок);
			
		Иначе
			
		
		Элементы.ГруппаОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаШаг2;
		
		КонецЕсли;
		
	ИначеЕсли Элементы.ГруппаОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаШаг2 Тогда
		
		Объект.ВыработкаСотрудников.Очистить();

		Элементы.ГруппаОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаШаг1;
		
	КонецЕсли;
	
	УстановитьВидимостьКнопокКоманднойПанели(Элементы.ГруппаОсновнаяПанель.ТекущаяСтраница);
	
КонецПроцедуры

&НаКлиенте
Процедура НазадШаг3Продолжение(Ответ,ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Отмена Тогда
        Возврат;
	КонецЕсли;	
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		УдалитьСформированныеДокументы();
		
	КонецЕсли;
	
	Элементы.ГруппаОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаШаг2; 
	
	УстановитьВидимостьКнопокКоманднойПанели(Элементы.ГруппаОсновнаяПанель.ТекущаяСтраница);
	
КонецПроцедуры

&наСервере
Процедура УдалитьСформированныеДокументы()
	
	Для Каждого СтрокаТЧ ИЗ Объект.ВыработкаСотрудников Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ВыработкаСотрудников) Тогда
			Продолжить;
		КонецЕсли;
		
		ДокОбъект = СтрокаТЧ.ВыработкаСотрудников.ПолучитьОбъект();
		ДокОбъект.УстановитьПометкуУдаления(Истина);
		
	КонецЦикла;
	
	Объект.ВыработкаСотрудников.Очистить();

КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьФормированиеЗаказов(Команда)
	
	Объект.ТабельИсполнителяРабот.Очистить();
	Объект.ВыработкаСотрудников.Очистить();
	
	Элементы.ГруппаОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаШаг1;
	УстановитьВидимостьКнопокКоманднойПанели(Элементы.ГруппаОсновнаяПанель.ТекущаяСтраница);
	
КонецПроцедуры

&НаКлиенте
Процедура ТабельУстановитьФлажки(Команда)

	Для Каждого ТекСтрока Из Объект.ТабельИсполнителяРабот Цикл
		ТекСтрока.Признак = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабельСнятьФлажки(Команда)

	Для Каждого ТекСтрока Из Объект.ТабельИсполнителяРабот Цикл
		ТекСтрока.Признак = Ложь;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура УстановитьВидимостьКнопокКоманднойПанели(ТекущаяСтраница)
	
	Если ТекущаяСтраница = Элементы.СтраницаШаг1 Тогда
				
		Элементы.СтраницыКомандыНиз.ТекущаяСтраница  = Элементы.СтраницаКомандыНизШаг1;
		Элементы.ДалееШаг1.КнопкаПоУмолчанию = Истина;
		
	ИначеЕсли ТекущаяСтраница = Элементы.СтраницаШаг2 Тогда
		
		Элементы.СтраницыКомандыНиз.ТекущаяСтраница  = Элементы.СтраницаКомандыНизШаг2;
		Элементы.ДалееШаг2.КнопкаПоУмолчанию = Истина;
		
	ИначеЕсли ТекущаяСтраница = Элементы.СтраницаШаг3 Тогда
		
		Элементы.СтраницыКомандыНиз.ТекущаяСтраница  = Элементы.СтраницаКомандыНизШаг3;
		Элементы.ЗавершитьФормированиеЗаказовШаг3.КнопкаПоУмолчанию = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабельИсполнителяРабот()
		
	Запрос = Новый Запрос;
	
	Если НовыйВариант Тогда
		
		Запрос.УстановитьПараметр("СценарийПланирования",СценарийПланирования);
		Запрос.УстановитьПараметр("Работа",	Объект.Работа);
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИСТИНА КАК Признак,
		|	УСОERP_СтроительныеРаботы.Ссылка КАК Работа,
		|	УСОERP_ТабельИсполнителейРаботОстатки.Ресурс,
		|	УСОERP_ТабельИсполнителейРаботОстатки.ТипРесурса КАК ДолжностьТипМашинМеханизмов,
		|	УСОERP_ТабельИсполнителейРаботОстатки.Исполнитель,
		|	УСОERP_ТабельИсполнителейРаботОстатки.КоличествоОстаток КАК ОбщееКоличествоЧасов
		|ИЗ
		|	РегистрНакопления.УСОERP_ТабельИсполнителейРабот.Остатки(
		|			&ДатаСбораДанных,
		|			ОбъектСтроительства = &ОбъектСтроительства
		|				И Организация = &Организация
		|				И Подразделение = &Подразделение
		|				И Исполнитель = &Исполнитель
		|				И Ресурс = &Ресурс) КАК УСОERP_ТабельИсполнителейРаботОстатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УСОERP_СтроительныеРаботы КАК УСОERP_СтроительныеРаботы
		|		ПО УСОERP_ТабельИсполнителейРаботОстатки.Работа = УСОERP_СтроительныеРаботы.РаботаИсточник
		|ГДЕ
		|	УСОERP_СтроительныеРаботы.Владелец = &СценарийПланирования
		|	И НЕ УСОERP_СтроительныеРаботы.ПометкаУдаления
		|	И ВЫБОР
		|			КОГДА &Работа = ЗНАЧЕНИЕ(Справочник.УСОERP_СтроительныеРаботы.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ УСОERP_СтроительныеРаботы.Ссылка = &Работа
		|		КОНЕЦ";
		
	Иначе
		
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИСТИНА КАК Признак,
		|	УСОERP_ТабельИсполнителейРаботОстатки.Работа,
		|	УСОERP_ТабельИсполнителейРаботОстатки.Ресурс,
		|	УСОERP_ТабельИсполнителейРаботОстатки.ТипРесурса КАК ДолжностьТипМашинМеханизмов,
		|	УСОERP_ТабельИсполнителейРаботОстатки.Исполнитель,
		|	УСОERP_ТабельИсполнителейРаботОстатки.КоличествоОстаток КАК ОбщееКоличествоЧасов
		|ИЗ
		|	РегистрНакопления.УСОERP_ТабельИсполнителейРабот.Остатки(
		|			&ДатаСбораДанных,
		|			ОбъектСтроительства = &ОбъектСтроительства
		|				И Организация = &Организация
		|				И Подразделение = &Подразделение
		|				И Исполнитель = &Исполнитель
		|				И Работа = &Работа
		|				И Ресурс = &Ресурс) КАК УСОERP_ТабельИсполнителейРаботОстатки";
	КонецЕсли;
	
	
	// Обязательные параметры	
	Запрос.УстановитьПараметр("ДатаСбораДанных", 		КонецДня(Объект.ДатаСбораДанных));
	Запрос.УстановитьПараметр("ОбъектСтроительства", 	Объект.ОбъектСтроительства);
	Запрос.УстановитьПараметр("Организация", 			Объект.Организация);
	Запрос.УстановитьПараметр("Подразделение", 			Объект.Подразделение);
	
	// Доп. параметры	
	Если ЗначениеЗаполнено(Объект.Работа) Тогда
		Запрос.УстановитьПараметр("Работа",	Объект.Работа);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Работа = &Работа", "");
	КонецЕсли;

	Если ЗначениеЗаполнено(Объект.Ресурс) Тогда
		Запрос.УстановитьПараметр("Ресурс",	Объект.Ресурс);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Ресурс = &Ресурс", "");
	КонецЕсли;

	Если ЗначениеЗаполнено(Объект.Исполнитель) Тогда
		Запрос.УстановитьПараметр("Исполнитель", Объект.Исполнитель);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Исполнитель = &Исполнитель", "");
	КонецЕсли;

	ТЗ_Результат = Запрос.Выполнить().Выгрузить();
	
	Объект.ТабельИсполнителяРабот.Загрузить(ТЗ_Результат);
			
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВыработкуСотрудников()
	
	ОтборВыделенныхСтрок = Новый Структура;
	ОтборВыделенныхСтрок.Вставить("Признак", Истина);
	МассивСтрокТЧ = Объект.ТабельИсполнителяРабот.НайтиСтроки(ОтборВыделенныхСтрок);
	
	Если МассивСтрокТЧ.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТЗ_ДокументыПоРаботам = Объект.ТабельИсполнителяРабот.Выгрузить(МассивСтрокТЧ, "Работа, Ресурс");
	ТЗ_ДокументыПоРаботам.Свернуть("Работа, Ресурс");
	
	Для Каждого ТекБригада Из ТЗ_ДокументыПоРаботам Цикл
	
		Попытка
			ДокументВыработки = Документы.ВыработкаСотрудников.СоздатьДокумент();
		Исключение 
			ЗаписьЖурналаРегистрации("Ошибка! Не удалось создать документ: ""Выработка сотрудников"".", 
									УровеньЖурналаРегистрации.Ошибка, 
									Метаданные.Документы.ВыработкаСотрудников);
									Сообщить(ОписаниеОшибки());
			Возврат; 
		КонецПопытки;
	
		ДокументВыработки.Дата				= Объект.ДатаСбораДанных;
		ДокументВыработки.Организация 		= Объект.Организация;
		ДокументВыработки.Подразделение 	= Объект.Подразделение;
		//ДокументВыработки.ПоРаспоряжениям 	= Ложь;
		ДокументВыработки.Автораспределение = Ложь;
		ДокументВыработки.ВидНаряда 		= Перечисления.ВидыБригадныхНарядов.БригадныйБезЗаказа21;
		ДокументВыработки.Ответственный		= Пользователи.ТекущийПользователь();
		ДокументВыработки.УСОERP_БлокУСП	= Истина;
	
		Попытка
			ДокументВыработки.Записать(РежимЗаписиДокумента.Запись);
		Исключение 
			ЗаписьЖурналаРегистрации("Ошибка! Не удалось записать документ: ""Выработка сотрудников"".", 
									УровеньЖурналаРегистрации.Ошибка, 
									Метаданные.Документы.ВыработкаСотрудников);
									Сообщить(ОписаниеОшибки());
			Возврат; 
		КонецПопытки;
			
		ТЗ_Табель = Объект.ТабельИсполнителяРабот.Выгрузить(МассивСтрокТЧ,);
		ТЗ_Табель.Свернуть("Признак, Работа, Ресурс, ДолжностьТипМашинМеханизмов, Исполнитель", "ОбщееКоличествоЧасов");
		
		ОбрабатываемыеСтроки = ТЗ_Табель.НайтиСтроки(Новый Структура("Работа, Ресурс", ТекБригада.Работа, ТекБригада.Ресурс));
		ТЗ_ТабельИсполнителяРабот = ТЗ_Табель.Скопировать(ОбрабатываемыеСтроки);
		
		Пока ТЗ_ТабельИсполнителяРабот.Количество() <> 0 Цикл
			
			ПерваяРабота 	= ТЗ_ТабельИсполнителяРабот[0].Работа;
			ПерваяРесурс 	= ТЗ_ТабельИсполнителяРабот[0].Ресурс;
			УИДпоРаботе		= Новый УникальныйИдентификатор;
			ОтборТабель 	= Новый Структура;
			ОтборТабель.Вставить("Работа", ПерваяРабота);
			
			МассивСтрок_ТабельИсполнителяРабот = ТЗ_ТабельИсполнителяРабот.НайтиСтроки(ОтборТабель);
			
			СуммаПоРаботе 		= 0;
			КоличествоПоРаботе 	= 0;
			
			Для Каждого ТекСтрока Из МассивСтрок_ТабельИсполнителяРабот Цикл
				
				Если ТипЗнч(ТекСтрока.Исполнитель) = Тип("СправочникСсылка.Сотрудники") Тогда
					
					СтрокаТЧ = ДокументВыработки.Работники.Добавить();
					СтрокаТЧ.Работник 		= ТекСтрока.Исполнитель.ФизическоеЛицо;
					СтрокаТЧ.ОтработаноЧасов 	= ТекСтрока.ОбщееКоличествоЧасов;
					СтрокаТЧ.УСОERP_ТипРесурса = ТекСтрока.ДолжностьТипМашинМеханизмов;
					
					КоличествоПоРаботе		= КоличествоПоРаботе + СтрокаТЧ.ОтработаноЧасов;
					
					Отбор = Новый Структура;
					Отбор.Вставить("Ресурс", 			ТекСтрока.Ресурс);
					Отбор.Вставить("ОбъектСтоимости", 	ТекСтрока.ДолжностьТипМашинМеханизмов);
					Отбор.Вставить("ВидЦены", 			Объект.ВидЦены);
					Отбор.Вставить("Валюта", 			Константы.ВалютаРегламентированногоУчета.Получить());
					
					СтрокаВыработки = Объект.ВыработкаСотрудников.Добавить();
					СтрокаВыработки.ВыработкаСотрудников 	= ДокументВыработки.Ссылка;
					СтрокаВыработки.Работа					= ПерваяРабота;
					СтрокаВыработки.Исполнитель				= ТекСтрока.Исполнитель;
					СтрокаВыработки.КоличествоЧасов			= ТекСтрока.ОбщееКоличествоЧасов;
					
					ТЗ_СрезСтоимости = РегистрыСведений.УСОERP_СтоимостьРесурсов.СрезПоследних(,Отбор);
					
					Если ТЗ_СрезСтоимости.Количество() <> 0 Тогда
						СтрокаТЧ.Сумма 	= СтрокаТЧ.ОтработаноЧасов * ТЗ_СрезСтоимости[0].Стоимость;
						СуммаПоРаботе 	= СуммаПоРаботе + СтрокаТЧ.Сумма;
						СтрокаВыработки.СтоимостьЧаса			= ТЗ_СрезСтоимости[0].Стоимость;
						СтрокаВыработки.ОбщаяСтоимостьРаботы	= СтрокаТЧ.Сумма;
					КонецЕсли;
					
				КонецЕсли;
				
				СтрокаТЧ = ДокументВыработки.ВидыРабот.Добавить();
				СтрокаТЧ.Работник = ТекСтрока.Исполнитель.ФизическоеЛицо;
				СтрокаТЧ.ВидРабот 	= Справочники.ВидыРаботСотрудников.СМР;
				СтрокаТЧ.УСОERP_Работа = ПерваяРабота;
				СтрокаТЧ.УСОERP_Ресурс = ПерваяРесурс;			
				СтрокаТЧ.Сумма		= СуммаПоРаботе;
				СтрокаТЧ.Количество	= КоличествоПоРаботе;
				СтрокаТЧ.Количество	= ТекСтрока.ОбщееКоличествоЧасов;  			
				СтрокаТЧ.Расценка	= ?(СтрокаТЧ.Количество <> 0, СтрокаТЧ.Сумма / СтрокаТЧ.Количество, 0); 
				
				ТЗ_ТабельИсполнителяРабот.Удалить(ТекСтрока);				
				
			КонецЦикла;
					
			//СтрокаТЧ = ДокументВыработки.ВидыРабот.Добавить();
			//СтрокаТЧ.Работник = ТекСтрока.Исполнитель.ФизическоеЛицо;
			//СтрокаТЧ.ВидРабот 	= Справочники.ВидыРаботСотрудников.СМР;
			//СтрокаТЧ.УСОERP_Работа = ПерваяРабота;
			//СтрокаТЧ.УСОERP_Ресурс = ПерваяРесурс;
			////СтрокаТЧ.КлючСтроки	= УИДпоРаботе;
			//СтрокаТЧ.Сумма		= СуммаПоРаботе;
			//СтрокаТЧ.Количество	= КоличествоПоРаботе;
			//СтрокаТЧ.Расценка	= ?(СтрокаТЧ.Количество <> 0, СтрокаТЧ.Сумма / СтрокаТЧ.Количество, 0);
			
		КонецЦикла;
		
		Попытка
			ДокументВыработки.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
		Исключение 
			ЗаписьЖурналаРегистрации("Ошибка! Не удалось перезаписать документ: " + ДокументВыработки.Ссылка, 
									УровеньЖурналаРегистрации.Ошибка, 
									Метаданные.Документы.ВыработкаСотрудников);
									Сообщить(ОписаниеОшибки());
			Возврат; 
		КонецПопытки;
		
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Процедура ДокументУтвержденияПриИзмененииНаСервере()
	
	НовыйВариант = ДокументУтверждения.СценарийПланирования.НовыйВариант = Истина;
	Объект.ДатаСбораДанных = ДокументУтверждения.Дата;
	Если ЗначениеЗаполнено(ДокументУтверждения) Тогда
	СценарийПланирования = ДокументУтверждения.КопияСценария;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументУтвержденияПриИзменении(Элемент)
	ДокументУтвержденияПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДокументУтвержденияОчистка(Элемент, СтандартнаяОбработка)
	
	ДокументУтвержденияПриИзменении(Элемент);

КонецПроцедуры

&НаКлиенте
Процедура ОбъектСтроительстваПриИзменении(Элемент)
	
	СценарийПланирования = УСОERP_УправлениеСтроительнымПроизводством.ПолучитьРабочийСценарий(Объект.ОбъектСтроительства, Объект.Организация);

КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	СценарийПланирования = УСОERP_УправлениеСтроительнымПроизводством.ПолучитьРабочийСценарий(Объект.ОбъектСтроительства, Объект.Организация);

КонецПроцедуры
